Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedTemperatureUnit
Undefined temperature unit: '[Temperature Unit Type Name]'

Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedFluidUnit
Undefined fluid unit: '[Fluid Unit Type Name]'

Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertToDouble
Cannot convert '[Text] ' to double value

Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertTempToDouble
Cannot convert temperature '[Temperate Value]' to double value

Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertPercentToDouble
Cannot convert concentration percent ' [Percentage Value] ' to double value

Autodesk.Revit.DB.BuiltInFailures.ConversionFailures
Failures about conversion of data to a different format.